In [5]:
import pandas as pd

dataObj = {"a":[1,2,3,4,5],"s":[1,2,3,4,5],"t":[1,2,3,4,5]}
dObj = pd.DataFrame(dataObj)
print(dObj)

   a  s  t
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  5  5

In [9]:
dataobj = pd.read_csv("/home/tushyap.bari/python-ws/Test_new2.csv",names = ["col1","col2","col3"])
dataobj

   col1  col2  col3
0     1     2     3
1     1     1     1
2     2     2     2
3     3     3     3
4     4     4     4
5     5     5     5

In [7]:
dObj.to_csv("Test_new1.csv", index = False)

In [6]:
dObj.to_csv("Test_new2.csv", index = False, header=[1,2,3])

# Read CSV

In [3]:
import pandas as pd
csv_1 = pd.read_csv("/home/tushyap.bari/python-ws/email.csv")
csv_1 = pd.DataFrame(csv_1)
csv_1

  Login email;Identifier;First name;Last name
0           laura@example.com;2070;Laura;Grey
1        craig@example.com;4081;Craig;Johnson
2          mary@example.com;9346;Mary;Jenkins
3          jamie@example.com;5079;Jamie;Smith

In [4]:
csv_1 = pd.read_csv("/home/tushyap.bari/python-ws/email.csv", nrows = 3)

csv_1

  Login email;Identifier;First name;Last name
0           laura@example.com;2070;Laura;Grey
1        craig@example.com;4081;Craig;Johnson
2          mary@example.com;9346;Mary;Jenkins

In [49]:
csv_5 = pd.read_csv("/home/tushyap.bari/python-ws/username.csv",  names = ["col1","col2","col3","col4"])

csv_5

                                      col1  col2  col3  col4
0  Username; Identifier;Firstname;Lastname   NaN   NaN   NaN
1              booker12;9012;Rachel;Booker   NaN   NaN   NaN
2                   grey07;2070;Laura;Grey   NaN   NaN   NaN
3             johnson81;4081;Craig;Johnson   NaN   NaN   NaN
4              jenkins46;9346;Mary;Jenkins   NaN   NaN   NaN
5                 smith79;5079;Jamie;Smith   NaN   NaN   NaN

In [31]:
csv_2 = pd.read_csv("/home/tushyap.bari/python-ws/email.csv", usecols = [0])

csv_2

  Login email;Identifier;First name;Last name
0           laura@example.com;2070;Laura;Grey
1        craig@example.com;4081;Craig;Johnson
2          mary@example.com;9346;Mary;Jenkins
3          jamie@example.com;5079;Jamie;Smith

In [28]:
csv_3 = pd.read_csv("/home/tushyap.bari/python-ws/email.csv", skiprows = [2])

csv_3

  Login email;Identifier;First name;Last name
0           laura@example.com;2070;Laura;Grey
1          mary@example.com;9346;Mary;Jenkins
2          jamie@example.com;5079;Jamie;Smith

In [46]:
csv_4 = pd.read_csv("/home/tushyap.bari/python-ws/username.csv")

csv_4

  Username; Identifier;Firstname;Lastname
0             booker12;9012;Rachel;Booker
1                  grey07;2070;Laura;Grey
2            johnson81;4081;Craig;Johnson
3             jenkins46;9346;Mary;Jenkins
4                smith79;5079;Jamie;Smith